{
	"@metadata": {
		"authors": [
			"Meno25",
			"ديفيد"
		]
	},
	"mwa-extensionname": "ميدياويكيوث",
	"mwa-desc": "يصادق على عمليات الدخول والواردات من مثيل خارجي لميدياويكي",
	"mwa-config-allowpasswordchange": "إذا كان هذا <code>true</code> ، بعد استيراد حسابه ، سيُطلب من المستخدم تغيير كلمة المرور الخاصة به اختياريًا (أو اختيار زر تخطي للاحتفاظ بنفس كلمة المرور).",
	"mwa-config-apiurl": "مسار api.php الويكي البعيد للمصادقة عليه",
	"mwa-config-importgroups": "يتحكم هذا التكوين في مجموعات المستخدمين المحلية التي يتم تعيينها للمستخدم. إذا كان هذا <code>true</code> (الافتراضي) ، فسيتم استيراد جميع عضويات المجموعة التي يمتلكها المستخدم على موقع wiki البعيد إلى موقع wiki المحلي ، بشرط وجود مجموعات تحمل نفس الاسم محليًا. في حالة <code>false</code> ، لا يتم استيراد عضويات المجموعة. إذا كانت المصفوفة ، فإن التكوين يسرد المجموعات المراد نسخها ؛ يتم استيراد تلك المدرجة فقط. في كلتا الحالتين ، لا يمكن استيراد المجموعات الضمنية ، ويتم الاحتفاظ بأي بيانات انتهاء صلاحية مجموعة كما هي.",
	"mwa-config-importoptions": "يتحكم هذا التكوين في تفضيلات المستخدم التي يتم استيرادها من موقع wiki البعيد. وهي عبارة عن مجموعة من أسماء خيارات تفضيل المستخدم الداخلي. ستقوم قيمة حرف بدل اختيارية ( <code>'*'</code> ) موجودة في المصفوفة باستيراد كل شيء. إذا كانت المصفوفة فارغة ، فلن يتم استيراد أي خيارات. إذا كانت المصفوفة لا تحتوي على حرف بدل ، فسيتم استيراد الخيارات المحددة فقط.",
	"mwa-config-skipoptions": "يتحكم هذا التكوين في تفضيلات المستخدم التي لا يتم استيرادها من موقع wiki البعيد. وهي عبارة عن مجموعة من أسماء خيارات تفضيل المستخدم الداخلي. لن يتم استيراد التفضيلات المدرجة هنا ، حتى إذا كانت مدرجة في <code>$wgMediaWikiAuthImportOptions</code> . يستخدم هذا بشكل أساسي عندما ترغب في استيراد كل شيء \"باستثناء\" لبعض قائمة الخيارات.",
	"mwa-config-disableaccountcreation": "إذا كان هذا <code>true</code> ، يفترض MediaWikiAuth أن جميع المستخدمين المعنيين قد تم إنشاؤهم محليًا بالفعل ، ولكن باستخدام تجزئات كلمة مرور غير صالحة. يكون هذا مفيدًا إذا كنت ترغب فقط في استيراد مجموعة فرعية من كافة المستخدمين في موقع wiki البعيد ، مثل أي شخص قام بالتحرير عن بُعد. إذا كان هذا <code>true</code> ، فسوف يكتشف MediaWikiAuth كلمة المرور غير الصالحة ويحاول المصادقة على wiki البعيد باستخدام كلمة المرور المحددة للمستخدم. في حالة النجاح ، سيُطلب من المستخدم تغيير كلمة المرور المحلية الخاصة به حتى يتمكن من تسجيل الدخول بشكل طبيعي في المستقبل.! N !! N! عند العمل في هذا الوضع ، لا تحدث قائمة المراقبة واستيراد المجموعة وتحرير إعادة التوزيع. يتم تجاهل هذه الإعدادات.",
	"mwa-config-importwatchlist": "إذا كان هذا <code>true</code> ، فسيتم استيراد قوائم المراقبة عبر قائمة انتظار الوظائف. إذا كانت <code>false</code> ، فلن يتم استيراد قوائم المراقبة. سيؤدي تمكين هذا إلى تقديم طلبات إضافية إلى واجهة برمجة التطبيقات البعيدة. إذا كان الخادم البعيد بطيئًا بشكل استثنائي ، فقد تنتهي مهلة هذه الطلبات الإضافية لعملية استيراد المستخدم. في هذه الحالة ، سترغب في تعطيل هذا الإعداد.",
	"mwa-config-reattributeedits": "إذا كان هذا <code>true</code> ، فسيتم إعادة إسناد التعديلات المستوردة الحالية التي تتطابق مع اسم مستخدم الحساب الذي تم إنشاؤه حديثًا عبر قائمة انتظار الوظائف بحيث تظهر بشكل صحيح في صفحة مساهمات هذا المستخدم. إذا كانت <code>false</code> ، فلن تحدث إعادة التوزيع.",
	"mwa-error-unknown": "خطأ غير معروف عند تسجيل الدخول إلى الويكي عن بعد.",
	"mwa-authfail": "غير قادر على تسجيل الدخول إلى الويكي عن بعد لاستيراد حسابك; تأكد من أنك تستخدم كلمة المرور الصحيحة.",
	"mwa-authfail2": "تعذر تسجيل الدخول إلى موقع wiki البعيد لاستيراد حسابك. يحتوي موقع wiki البعيد على الخطأ التالي: $1",
	"mwa-finishcreate": "تم استيراد حسابك بنجاح; يمكنك تعيين كلمة سر جديدة الآن أو اختيار \"$1\" للاحتفاظ بكلمة السر الحالية.",
	"mwa-finishimport-nocreate": "تم استيراد حسابك بنجاح، يُرجَى تعيين كلمة مرور جديدة لتحسين الأمن.",
	"mwa-unconfiguredtitle": "ملحق غير مكون.",
	"mwa-unconfiguredtext": "لم يتم تكوين إضافة MediaWikiAuth ; تأكد من تعيين $wgMediaWikiAuthApiUrl في LocalSettings.php الخاص بك إلى مسار API الويكي البعيد.",
	"action-mwa-createlocalaccount": "إنشاء حسابات محلية بنفس اسم المستخدم كحساب خارجي غير مستورد",
	"right-mwa-createlocalaccount": "إنشاء حسابات محلية بنفس اسم المستخدم كحساب خارجي غير مستورد"
}
