{
	"@metadata": {
		"authors": [
			"ديفيد",
			"Meno25"
		]
	},
	"mwa-desc": "يصادق على عمليات الدخول والواردات من مثيل خارجي لميدياويكي",
	"mwa-config-allowpasswordchange": "إذا كان هذا صحيحا، فبعد استيراد حسابه، سيُطلَب من المستخدم تغيير كلمة مروره اختياريا (أو اختيار زر تخطي للاحتفاظ بنفس كلمة المرور).",
	"mwa-config-apiurl": "مسار api.php الويكي البعيد للمصادقة عليه",
	"mwa-config-importgroups": "يتحكم هذا التكوين في مجموعات المستخدمين المحلية التي تم تعيينها للمستخدم، إذا كان هذا صحيحا (الافتراضي)، فسيتم استيراد جميع عضويات المجموعة التي كانت لدى المستخدم على الويكي البعيد إلى الويكي المحلي، شريطة وجود مجموعات بنفس الاسم محليا، إذا كان خطأ، لا يتم استيراد عضوية المجموعة، إذا كان هناك صفيف، يسرد التكوين المجموعات التي تريد نسخها، فقط تلك المدرجة يتم استيرادها، في كلتا الحالتين، لا يمكن استيراد المجموعات الضمنية، ويتم الاحتفاظ بأي بيانات انتهاء صلاحية للمجموعة سليمة.",
	"mwa-config-disableaccountcreation": "إذا كان صحيحا، تفترض مصادقة ميدياويكي أن جميع المستخدمين المعنيين قد تم إنشاؤهم محليا بالفعل، ولكن مع تجزئة كلمة مرور غير صالحة، هذا مفيد إذا كنت ترغب فقط في استيراد بعض المجموعات الفرعية لجميع المستخدمين على الويكي البعيد، مثل أي شخص قام بالتحرير عن بعد، إذا كان صحيحا، فستقوم مصادقة ميدياويكي بالكشف عن كلمة المرور غير الصالحة ومحاولة المصادقة على الويكي البعيد بكلمة مرور المستخدم المعطاة، إذا نجحت، سيُطلَب من المستخدم تغيير كلمة المرور المحلية حتى يتمكن من تسجيل الدخول بشكل طبيعي في المستقبل.\n\nعند التشغيل في هذا الوضع، لا تحدث إعادة إسناد قائمة المراقبة واستيراد المجموعات وتعديل إعادة التوزيع، يتم تجاهل هذه الإعدادات.",
	"mwa-config-importwatchlist": "إذا كان صحيحا، فسيتم استيراد قوائم المراقبة عبر قائمة انتظار المهمة، إذا كان خطأ، فلن يتم استيراد قوائم المراقبة، سيؤدي تمكين هذا إلى ظهور طلبات إضافية على واجهة برمجة التطبيقات البعيدة، إذا كان الخادم البعيد بطيئا بشكل استثنائي، فقد تنقضي هذه الطلبات الإضافية في عملية استيراد المستخدم، في هذه الحالة، سوف تحتاج إلى تعطيل هذا الإعداد.",
	"mwa-config-reattributeedits": "إذا كان هذا صحيحا، فستتم إعادة توزيع التعديلات التي تم استيرادها الحالية والتي تتطابق مع اسم مستخدم الحساب الذي تم إنشاؤه حديثا عبر قائمة انتظار المهمة حتى تظهر بشكل صحيح في صفحة \"مساهمات\" هذا المستخدم، إذا كان خطأ، لا تحدث إعادة توزيع.",
	"mwa-error-unknown": "خطأ غير معروف عند تسجيل الدخول إلى الويكي عن بعد.",
	"mwa-authfail": "غير قادر على تسجيل الدخول إلى الويكي عن بعد لاستيراد حسابك; تأكد من أنك تستخدم كلمة المرور الصحيحة.",
	"mwa-finishcreate": "تم استيراد حسابك بنجاح; يمكنك تعيين كلمة سر جديدة الآن أو اختيار \"$1\" للاحتفاظ بكلمة السر الحالية.",
	"mwa-finishimport-nocreate": "تم استيراد حسابك بنجاح، يُرجَى تعيين كلمة مرور جديدة لتحسين الأمن.",
	"mwa-unconfiguredtitle": "ملحق غير مكون.",
	"mwa-unconfiguredtext": "لم يتم تكوين إضافة MediaWikiAuth ; تأكد من تعيين $wgMediaWikiAuthApiUrl في LocalSettings.php الخاص بك إلى مسار API الويكي البعيد.",
	"action-mwa-createlocalaccount": "إنشاء حسابات محلية بنفس اسم المستخدم كحساب خارجي غير مستورد",
	"right-mwa-createlocalaccount": "إنشاء حسابات محلية بنفس اسم المستخدم كحساب خارجي غير مستورد"
}
