{
	"@metadata": {
		"authors": [
			"Умар"
		]
	},
	"mwa-desc": "Арахьарчу MediaWiki инстанцера логинашна дуьхьал аутентификаци йо а, импорт йо а",
	"mwa-config-allowpasswordchange": "Нагахь санна <code>true</code> делахь, шайн аккаунтца импорт йинчул тӀаьхьа лелочунна дехар дийр ду шен лаамехь хийца пароль (йа нуьйдин тӀетаӀайе «ДӀасаца», изза пароль латто).",
	"mwa-config-apiurl": "URL дӀайаьккхинчу викин api.php дуьхьал аутентификаци йан.",
	"mwa-config-importgroups": "ХӀокху конфигурацино Ӏуналла до, муьлха локалан лелоран тобанаш йу декъашхошна тӀедиллина. Нагахь санна <code>true</code> (стандартан), массо а тобанан декъашхой, лелоран генарчу вики тӀехь хилла, меттигерчу вики чу чуйохьу, нагахь санна изза цӀе йолу тобанаш локалан йелахь. Нагахь санна <code>false</code> делахь, тобанан декъашхой импорт ца бо. Нагахь санна массив йелахь, конфигурацино гойту муьлхачу тобанашна тӀехула копеш йан йеза; гайтинарш бен импорт ца до. ХӀокху шинна а хьолехь имплицитан тобанаш чуйало йиш йац, муьлхха а тобанан хан чекхйаларан хаамаш Ӏалашбо.",
	"mwa-config-importoptions": "ХӀокху конфигурацино Ӏуналла до муьлха лелоран лаамаш генарчу вики чуьра импорт йо. Иза массив йу чоьхьарчу лелоран вариантан цӀерашца. Массивехь долчу лаамехь долчу хьаьркийн маьӀна (<code>'*'</code>) дерриг а импорт дийр ду. Нагахь санна массив йаьсса йелахь, цхьа а опци импорт йийр йац. Нагахь санна массивехь меттахӀотторан хьаьрк йацахь, билгалйаьхна опцеш бен импорт йийр йац.",
	"mwa-config-skipoptions": "ХӀокху конфигурацино Ӏуналла до муьлха лелоран лаамаш генарчу вики чуьра импорт ца бо. Иза массив йу чоьхьарчу лелоран вариантан цӀерашца. Кхузахь дӀайаздина хьашташ чудерзор дац, уьш <code>$wgMediaWikiAuthImportOptions</code> чохь дӀайаздина делахь а. ХӀара уггар хьалха леладо массо а ''доцург'' цхьацца опцин могӀаман импорт йан лаахь.",
	"mwa-config-disableaccountcreation": "Нагахь санна <code>бакъ</code> делахь, MediaWikiAuth лоруш ду массо а богӀуш болу декъашхой хӀинцале а меттигера кхоьллина хилар, амма нийса йоцу пароль хешашца. Иза пайдехьа ду, нагахь санна генарчу вики тӀехь массо а декъашхойн цхьа дакъа бен импорт ца дан лаахь, масала, генара хийцамаш бина массо а. Нагахь санна <code>true</code> делахь, MediaWikiAuth-о нийса йоцу пароль гучуйоккхур йу, декъашхочо билгалйаьккхинчу парольца авторизаци йан гӀерта. Нагахь санна кхиам хилахь, лелоран меттигера пароль хийца йеза, тӀейогӀучу хенахь нийса авторизаци йан аьтто хилийта.\n\nТергаман могӀамаш, тобанийн импорт, хийцамаш йуха атрибуци йар кхочуш ца до оцу рожехь. И нисдаран гӀирс тидаме ца оьцуш йу.",
	"mwa-config-importwatchlist": "Нагахь санна <code>true</code> делахь, тергаман могӀамаш импорт бийр бу белхан рогӀехула. Нагахь санна <code>false</code> хилча, тергаман могӀамаш импорт хир бац. Иза дӀахӀотторо генарчу API-на кхин а дехарш дийр ду. Нагахь санна генара сервер башха меллаша хилахь, оцу тӀетоьхначу дехарша хан йаккха тарло декъашхойн импортан процессан. Цу хьолехь, ахь и нисдаран гӀирс дӀабаккха безар бу.",
	"mwa-unconfiguredtitle": "Шордар дӀа ца йиллина."
}
