{
	"@metadata": {
		"authors": [
			"Metalhead64"
		]
	},
	"mwa-desc": "Authentifiziert Logins und importiert sie von einer externen MediaWiki-Instanz",
	"mwa-config-allowpasswordchange": "Wenn <code>true</code>, wird der Benutzer nach dem Import seines Kontos aufgefordert, optional sein Passwort zu ändern (oder wählen der Schaltfläche Überspringen, um das gleiche Passwort zu behalten).",
	"mwa-config-apiurl": "URL der api.php des entfernten Wikis, gegen das die Authentifizierung durchgeführt werden soll.",
	"mwa-config-importgroups": "Diese Konfiguration steuert, welche lokalen Benutzergruppen dem Benutzer zugeordnet werden. Wenn <code>true</code>(Standardeinstellung), werden alle Gruppenmitgliedschaften, die der Benutzer auf dem entfernten Wiki hatte, in das lokale Wiki importiert, sofern lokal gleichnamige Gruppen existieren. Wenn <code>false</code>, werden keine Gruppenmitgliedschaften importiert. Wenn es sich um ein Array handelt, listet die Konfiguration auf, welche Gruppen kopiert werden sollen; nur die aufgelisteten werden importiert. In beiden Fällen können implizite Gruppen nicht importiert werden, und alle Gruppenablaufdaten bleiben intakt.",
	"mwa-config-disableaccountcreation": "Wenn <code>true</code>, geht MediaWikiAuth davon aus, dass alle relevanten Benutzer bereits lokal, aber mit ungültigen Passwort-Hashes angelegt wurden. Dies ist nützlich, wenn du nur eine Teilmenge aller Benutzer auf dem entfernten Wiki importieren möchtest, wie z.B. alle, die entfernt bearbeitet haben. Wenn <code>true</code>, erkennt MediaWikiAuth das ungültige Passwort und versucht, sich mit dem vom Benutzer angegebenen Passwort gegen das entfernte Wiki zu authentifizieren. Wenn dies erfolgreich ist, wird der Benutzer aufgefordert, sein lokales Passwort zu ändern, so dass er sich in Zukunft normal einloggen kann.\n\nWenn er in diesem Modus arbeitet, finden Beobachtunzslisten-, Gruppenimporte und die erneute Bearbeitung von Attributen nicht statt. Diese Einstellungen werden ignoriert.",
	"mwa-config-importwatchlist": "Wenn <code>true</code>, werden Beobachtungslisten über die Jobwarteschlange importiert. Wenn <code>false</code>, werden Beobachtungslisten nicht importiert. Wenn du dies aktivierst, führt dies zu zusätzlichen Anfragen an die Remote-API. Sollte der Remote-Server außergewöhnlich langsam sein, können diese zusätzlichen Anforderungen den Benutzer-Importprozess verzögern. In diesem Fall solltest du diese Einstellung deaktivieren.",
	"mwa-config-reattributeedits": "Wenn <code>true</code>, werden vorhandene importierte Bearbeitungen, die mit dem Benutzernamen des neu erstellten Kontos übereinstimmen, über die Auftragswarteschlange neu zugeordnet, so dass sie auf der Beitragsseite dieses Benutzers korrekt angezeigt werden. Wenn <code>false</code>, erfolgt keine erneute Attributierung.",
	"mwa-error-unknown": "Beim Anmelden am Remote-Wiki ist ein unbekannter Fehler aufgetreten.",
	"mwa-authfail": "Die Anmeldung am Remote-Wiki zum Importieren deines Benutzerkontos war nicht erfolgreich. Stelle sicher, dass du das richtige Passwort verwendest.",
	"mwa-authfail2": "Es ist nicht möglich, sich in das Remote-Wiki einzuloggen, um dein Konto zu importieren. Das Remote-Wiki hatte folgenden Fehler: $1",
	"mwa-finishcreate": "Dein Benutzerkonto wurde erfolgreich importiert. Du kannst jetzt ein neues Passwort festlegen oder „$1“ auswählen, um dein aktuelles Passwort zu behalten.",
	"mwa-finishimport-nocreate": "Dein Benutzerkonto wurde erfolgreich importiert. Lege bitte für eine bessere Sicherheit ein neues Passwort fest.",
	"mwa-unconfiguredtitle": "Die Softwareerweiterung ist nicht konfiguriert.",
	"mwa-unconfiguredtext": "Die MediaWikiAuth-Softwareerweiterung ist nicht ordnungsgemäß konfiguriert. Stelle sicher, dass im Konfigurationsparameter $wgMediaWikiAuthApiUrl in deiner Datei LocalSettings.php die API-URL des Remote-Wikis festgelegt ist.",
	"action-mwa-createlocalaccount": "lokale Benutzerkonten mit den gleichen Benutzernamen als nicht importierte externe Benutzerkonten zu erstellen",
	"right-mwa-createlocalaccount": "Lokale Benutzerkonten mit dem gleichen Benutzernamen als nicht importiertes externes Benutzerkonto erstellen"
}
