{
	"@metadata": {
		"authors": [
			"Laurence \"GreenReaper\" Parry",
			"Ryan Schmidt"
		]
	},
	"mwa-extensionname": "MediaWikiAuth",
	"mwa-desc": "Authenticates against and imports logins from an external MediaWiki instance",
	"mwa-config-allowpasswordchange": "If <code>true</code>, after importing their account the user will be prompted to optionally change their password (or choose a Skip button to keep the same password).",
	"mwa-config-apiurl": "URL of the remote wiki's api.php to authenticate against.",
	"mwa-config-importgroups": "This configuration controls which local user groups are assigned to the user. If <code>true</code> (the default), all group memberships that the user had on the remote wiki are imported to the local wiki, provided groups of the same name exist locally. If <code>false</code>, no group memberships are imported. If an array, the configuration lists which groups to copy over; only those listed are imported. In either case, implicit groups cannot be imported, and any group expiration data is kept intact.",
	"mwa-config-disableaccountcreation": "If <code>true</code>, MediaWikiAuth assumes that all relevant users have already been created locally, but with invalid password hashes. This is useful if you only want to import some subset of all of the users on the remote wiki, such as anyone that has edited remotely. If <code>true</code>, MediaWikiAuth will detect the invalid password and attempt to auth against the remote wiki with the user's given password. If successful, the user will be required to change their local password so that they may log in normally in the future.\n\nWhen operating in this mode, watchlist, group imports, and edit reattribution do not happen. Those settings are ignored.",
	"mwa-config-importwatchlist": "If <code>true</code>, watchlists will be imported via the job queue. If <code>false</code>, watchlists will not be imported. Enabling this will cause additional requests to the remote API. Should the remote server be exceptionally slow, these additional requests may time out the user import process. In this case, you will want to disable this setting.",
	"mwa-config-reattributeedits": "If <code>true</code>, existing imported edits which match the newly-created account's username will be reattributed via the job queue so they properly show in that user's Contributions page. If <code>false</code>, no reattribution occurs.",
	"mwa-error-unknown": "Unknown error when logging in to the remote wiki.",
	"mwa-authfail": "Unable to log into the remote wiki to import your account. Ensure you are using the correct password.",
	"mwa-authfail2": "Unable to log into the remote wiki to import your account. The remote wiki had the following error: $1",
	"mwa-finishcreate": "Your account has been successfully imported. You may set a new password now or choose \"$1\" to keep your current password.",
	"mwa-finishimport-nocreate": "Your account has been successfully imported. Please set a new password for better security.",
	"mwa-unconfiguredtitle": "Extension not configured.",
	"mwa-unconfiguredtext": "The MediaWikiAuth extension is not configured properly. Ensure that $wgMediaWikiAuthApiUrl is set in your LocalSettings.php to the API URL of the remote wiki.",
	"action-mwa-createlocalaccount": "create local accounts with the same username as an unimported external account",
	"right-mwa-createlocalaccount": "Create local accounts with the same username as an unimported external account"
}
