{
	"@metadata": {
		"authors": [
			"Gomoko",
			"Pamputt",
			"Thibaut120094",
			"Wladek92"
		]
	},
	"mwa-desc": "Authentifie avec et importe les comptes depuis une instance MediaWiki externe",
	"mwa-config-allowpasswordchange": "Si <code>true</code>, après avoir importé son compte, l’utilisateur se verra proposer de changer son mot de passe de façon facultative (ou choisir un bouton Sauter pour conserver le même mot de passe).",
	"mwa-config-apiurl": "URL de api.php du wiki distant pour s’authentifier de nouveau.",
	"mwa-config-importgroups": "Cette configuration contrôle les groupes d’utilisateurs locaux qui sont affectés à l'utilisateur. S’il vaut <code>true</code> (la valeur par défaut), tous les groupes d’appartenance que l’utilisateur avait sur le wiki distant sont importés dans le wiki local, à condition que des groupes du même nom existent localement. S’il vaut <code>false</code>, aucune appartenance à un groupe n’est importée. S’il s’agit d’un tableau, la configuration liste les groupes à copier ; seuls ceux qui sont listés sont importés. Dans les deux cas, les groupes implicites ne peuvent pas être importés, et toute donnée d’expiration de groupe est laissée intacte.",
	"mwa-config-disableaccountcreation": "S’il vaut <code>true</code>, MediaWikiAuth suppose que tous les utilisateurs pertinents ont déjà été créés localement, mais avec des hachages de mots de passe non valides. Ceci est utile si vous voulez seulement importer quelque sous-ensemble de tous les utilisateurs sur le wiki distant, comme n’importe qui qui a édité à distance. S’il vaut <code>true</code>, MediaWikiAuth détectera le mot de passe non valide et tentera de s’authentifier auprès du wiki distant avec le mot de passe donné par l’utilisateur. En cas de succès, l’utilisateur devra changer son mot de passe local afin de pouvoir se connecter normalement à l’avenir.\n\nEn opérant dans ce mode, la liste de surveillance, les importations de groupes et la réattribution des modifications ne se produisent pas. Ces réglages sont ignorés.",
	"mwa-config-importwatchlist": "Si la valeur est <code>true</code>, les listes de suivi seront importées via la file de tâches. Si la valeur est <code>false</code>, elles ne seront pas importées. Activer cela entraînera des requêtes supplémentaires à l’API distant. Si le serveur distant était exceptionnellement lent, ces requêtes supplémentaires pourraient dépasser le délai du processus d’importation de l’utilisateur. Dans ce cas, vous voudrez désactiver ce paramètre.",
	"mwa-config-reattributeedits": "Si la valeur est <code>true</code>, les modifications importées existantes qui correspondent au nom d'utilisateur du compte nouvellement créé seront réattribuées via la file d'attente des travaux afin qu'elles s'affichent correctement sur la page Contributions de cet utilisateur. Si la valeur est <code>false</code>, aucune réattribution n'a lieu.",
	"mwa-error-unknown": "Erreur inconnue en se connectant au wiki distant",
	"mwa-authfail": "Impossible de se connecter au wiki distant pour importer votre compte. Assurez-vous d’utiliser le bon mot de passe.",
	"mwa-authfail2": "Impossible de se connecter au wiki distant pour importer votre compte. Le wiki distant présentait l’erreur suivante : $1",
	"mwa-finishcreate": "Votre compte a bien été importé. Vous pouvez définir un nouveau mot de passe maintenant, ou choisir « $1 » pour conserver l’actuel.",
	"mwa-finishimport-nocreate": "Votre compte a bien été importé. Veuillez définir un nouveau mot de passe pour une meilleure sécurité.",
	"mwa-unconfiguredtitle": "Extension non configurée.",
	"mwa-unconfiguredtext": "L’extension MediaWikiAuth n’est pas bien configurée. Assurez-vous que $wgMediaWikiAuthApiUrl est défini dans votre LocalSettings.php avec l’URL de l’API du wiki distant.",
	"action-mwa-createlocalaccount": "créer les comptes locaux avec le même nom d’utilisateur que les comptes externes non importés",
	"right-mwa-createlocalaccount": "Créer des comptes locaux avec le même nom d'utilisateur comme compte externe non importé"
}
