{
	"@metadata": {
		"authors": [
			"Amire80"
		]
	},
	"mwa-desc": "אימות ויבוא כניסות ממופע חיצוני של מדיה־ויקי",
	"mwa-config-allowpasswordchange": "אם זה <code>true</code>, לאחר יבוא החשבון, המשתמש יתבקש (אך לא יחויב) לשנות את הסיסמה שלו (או לבחור בלחצן לדלג כדי לשמור על אותה סיסמה).",
	"mwa-config-apiurl": "כתובת ה־URL של api.php של הוויקי המרוחק לאימות.",
	"mwa-config-importgroups": "התצורה הזאת שולטת בקבוצות משתמשים מקומיות שמוקצות למשתמש. אם זה <code>true</code> (ברירת המחדל), כל החברויות בקבוצות שהיו למשתמש בוויקי המרוחק מיובאות לוויקי המקומי, בתנאי שקבוצות באותו שם קיימות באופן מקומי. אם זה <code>false</code>, חברויות בקבוצות אינן מיובאות. אם זה מערך, התצורה מפרטת אילו קבוצות להעתיק; רק אלה שרשומות מיובאות. בכל מקרה, לא ניתן לייבא קבוצות משתמעות, וכל נתוני תפוגה של הקבוצה נשמרים ללא שינוי.",
	"mwa-config-importoptions": "התצורה הזאת שולטת בהעדפות המשתמש שמיובאות מהוויקי המרוחק. זהו מערך של שמות של העדפות משתמש פנימיות. ערך תו כללי לא מחייב (<code>'*'</code>) הקיים במערך ייבא הכול. אם המערך ריק, לא ייובאו שום העדפות. אם המערך אינו מכיל תו כללי, רק ייובאו ההעדפות שצוינו.",
	"mwa-config-skipoptions": "התצורה הדאת שולטת בהעדפות משתמש שאינן מיובאות מהוויקי המרוחק. זהו מערך של שמות העדפות משתמש פנימיות. העדפות המפורטות כאן לא ייובאו, גם אם הן רשומות ב־<code dir=\"ltr\">$wgMediaWikiAuthImportOptions</code>. זה משמש בעיקר כאשר ברצונך לייבא הכול ''מלבד'' רשימה מסוימת של אפשרויות.",
	"mwa-config-disableaccountcreation": "אם זה <code>true</code>, ההרחבה MediaWikiAuth תניח שכל המשתמשים הרלוונטיים כבר נוצרו באופן מקומי, אבל עם גיבובי סיסמה לא תקינים. זה שימושי אם ברצונך לייבא רק תת־קבוצה של כל המשתמשים בוויקי המרוחק, כגון כל מי שערך מרחוק. אם זה <code>true</code>, ההרחבה MediaWikiAuth תזהה את הסיסמה הבלתי־תקינה ותנסה לבצע אימות אל מול אתר הוויקי המרוחק עם הסיסמה שניתנה למשתמש. אם זה יצליח, המשתמש יידרש לשנות את הסיסמה המקומית שלו כדי שיוכל להיכנס כרגיל בעתיד.\n\nבפעולה במצב הזה, רשימת מעקב, פעולות יבוא קבוצתי, ושיוך עריכה לא מתרחשים. ההגדרות האלה לא משפיעות.",
	"mwa-config-importwatchlist": "אם זה <code>true</code> , רשימות מעקב ייובאו דרך תור המשימות. אם זה <code>false</code> , רשימות מעקב לא ייובאו. הפעלה של זה תגרום לבקשות נוספות לממשק ה־API המרוחק. אם השרת המרוחק יהיה איטי במיוחד, הבקשות הנוספות האלו עלולות להגביל את תהליך יבוא המשתמש. במקרה כזה, כדאי לכבות את ההגדרה הזאת.",
	"mwa-config-reattributeedits": "אם זה <code>true</code> , עריכות מיובאות קיימות שתואמות את שם המשתמש של החשבון החדש תיוחסנה מחדש דרך תור המשימות כך שיוצגו כראוי בדף התרומות של אותו המשתמש. אם זה <code>false</code>, לא נעשה ייחוס מחדש.",
	"mwa-error-unknown": "שגיאה לא ידועה בעת הכניסה לוויקי המרוחק.",
	"mwa-authfail": "לא ניתן להיכנס לוויקי המרוחק כדי לייבא את חשבונך. נא לוודא שהשתמשת בסיסמה הנכונה.",
	"mwa-authfail2": "לא ניתן להיכנס לוויקי המרוחק כדי לייבא את חשבונך. בוויקי המרוחק אירעה השגיאה הבאה: $1",
	"mwa-finishcreate": "החשבון שלך יובא בהצלחה. האפשרותך להגדיר סיסמה חדשה עכשיו או לבחור \"$1\" כדי לשמור את הסיסמה הנוכחית שלך.",
	"mwa-finishimport-nocreate": "החשבון שלך יובא בהצלחה. נא להגדיר סיסמה חדשה לאבטחה טובה יותר.",
	"mwa-unconfiguredtitle": "ההרחבה אינה מוגדרת.",
	"mwa-unconfiguredtext": "ההרחבה MediaWikiAuth אינה מוגדר כהלכה. נא לוודא ש־<span dir=\"ltr\">$wgMediaWikiAuthApiUrl</span> מוגדר ב־LocalSettings.php שלך לכתובת ה־API של הוויקי המרוחק.",
	"action-mwa-createlocalaccount": "ליצור חשבונות מקומיים עם אותו שם משתמש כמו חשבון חיצוני שלא מיובא",
	"right-mwa-createlocalaccount": "יצירת חשבונות מקומיים עם אותו שם משתמש כמו חשבון חיצוני שלא מיובא"
}
