{
	"@metadata": {
		"authors": [
			"Bjankuloski06",
			"Vlad5250"
		]
	},
	"mwa-desc": "Заверува увозни најави од надворешни примероци на МедијаВики",
	"mwa-config-allowpasswordchange": "Ако е точно, по увозот на сметката на корисникот ќе му биде понудено да ја смени лозинката, или пак да прескокне ако сака да ја задржи старата.",
	"mwa-config-apiurl": "URL до api.php на далечинското вики со кое ќе се направи заверка.",
	"mwa-config-importgroups": "Овие поставки уредуваат на кои групи им припаѓа корисникот. Ако е здадено на точно (по основно), сите групни членства на корисникот од оддалеченото вики се увезуваат во месното вики, доколку истите постојат и таму. Ако зададено на неточно, не се увезуваат групни членства. Ако е низа, поставките ги наведуваат групите што треба да се префрлат и се увезуваат само наведените. Во секој случај, не можат да се увезуваат подразбрани групи, и сите податоци за рок во групите се запазуваат какви што се.",
	"mwa-config-disableaccountcreation": "Ако е точно, MediaWikiAuth претпоставува дека сите релевантни корисници веќе се создадени месно, но со неважечки раздробници. Ова е корисно само ако сакате да увезете извесно подмножество од сите корисници од оддалеченото вики, како некој што има урдувано далечински. Ако е точно, MediaWikiAuth ќе ја пронајде неважечката лозинка и ќе се обиде да направи заверка според оддалеченото вики со дадената лозинка на корисникот. Ако ва успее, на корисникот ќе му биде побарано да ја промени неговата месна лозинка за да може да се најавува нормално во иднина.\n\nПри работа во овој режим, не работат набљудуваните, увезувањата на групи и преприписите на уредувања. Тие поставки се занемаруваат.",
	"mwa-config-importwatchlist": "Ако е точно, набљудувањата ќе се увезат преку редица на задачи. Ако е неточно, тие нема да се увезат. Овозможувањето на ова ќе предизвика дополнителни барања од оддалечениот приложник. Доколку оддалечениот опслужувач е исклучително бавен, овие барања може да предизикаат истек во увозното барање за корисникот. Во тој случај се порепорачува да се оневозможи таа поставка.",
	"mwa-config-reattributeedits": "Ако е точно, постоечките увезени уредувања што одговараат на корисничкото име на новосоздадената сметка ќе бидат преприпишани преку редица на задачи за да се прикажуваат правилно во придонесите на корисникот. Ако е неточно, нема да има преприпишување.",
	"mwa-error-unknown": "Се појави непозната грешка при најавата на оддалеченото вики.",
	"mwa-authfail": "Не можам да се најавам на оддалеченото вики за да ви ја увезам сметката. Проверете дали користите исправна лозинка.",
	"mwa-finishcreate": "Вашата сметка е успешно увезена. Сега можете да зададете нова лозинка или да изберете „$1“ за да ја задржите тековната.",
	"mwa-finishimport-nocreate": "Вашата сметка е успешно увезена. Задајте ѝ нова лозинка за подобра безбедност.",
	"mwa-unconfiguredtitle": "Додатокот не е нагоден.",
	"mwa-unconfiguredtext": "Додатокот МедијаВики не е соодветно нагоден. Проверете дали на $wgMediaWikiAuthApiUrl во вашите LocalSettings.php му е зададена URL на извршникот на оддалеченото вики.",
	"action-mwa-createlocalaccount": "создавање на месни сметки со исто корисничко име како неувезена надворешна сметка",
	"right-mwa-createlocalaccount": "Направи месни сметки со исто корисничко име како неувезена надворешна сметка"
}
