{
	"@metadata": {
		"authors": [
			"Jon Harald Søby"
		]
	},
	"mwa-desc": "Autentiserer mot og importerer innlogginger fra en ekstern MediaWiki-instans",
	"mwa-config-allowpasswordchange": "Etter importering av kontoen blir brukeren bedt om å endre passordet sitt (eller velge å hoppe over for å beholde det forrige passordet) hvis denne er <code>true</code>.",
	"mwa-config-apiurl": "URL-en til den eksterne wikiens api.php det skal autentiseres mot.",
	"mwa-config-importgroups": "Denne konfigurasjonen kontrollerer hvilke lokale brukergrupper som er tildelt brukeren. Hvis denne er <code>true</code> (standard) blir alle gruppemedlemskaper brukeren hadde på den eksterne wikien importert  til den lokale wikien, så fremt grupper med samme navn finnes lokalt. Hvis denne er <code>false</code> vil ingen gruppemedlemskap importeres. Hvis den er en tabell vil konfigurasjonen liste opp hvilke grupper som skal kopieres over; kun de som listes opp importeres. Uansett kan ikke implisitte grupper importeres, og utløpstider for gruppemedlemskap beholdes som de var.",
	"mwa-config-disableaccountcreation": "Hvis denne er <code>true</code> vil MediaWikiAuth anta at alle relevante brukere har blitt opprettet lokalt, med med ugyldige passordhasher. Dette er nyttig hvis du bare ønsker å importere et visst sett av brukerne på den eksterne wikien, som f.eks. kun de som har redigert. Hvis denne er <code>true</code> vil MediaWikiAuth oppdage det ugyldige passordet og forsøke å autentisere mot den eksterne wikien med brukerens gitte passord. Hvis det virker må brukeren endre passordet sitt lokalt så de kan logge inn normalt i framtida.\n\nNår denne modusen brukes blir ikke overvåkningslister og brukergrupper importer, og omattribusjon av redigeringer skjer ikke. Disse innstillingene ignoreres.",
	"mwa-config-importwatchlist": "Hvis denne er <code>true</code> blir overvåkningslister importert via jobbkøen. Hvis den er <code>false</code> blir ikke overvåkningslister importert. Å velge denne vil forårsake ekstra forespørsler til det eksterne API-et. Hvis den eksterne tjeneren er veldig treg vil disse forespørslene kunne gjøre at brukerimporteringen får et tidsavbrudd. Hvis det er tilfellet bør du slå av denne innstillingen.",
	"mwa-config-reattributeedits": "Hvis denne er <code>true</code> vil eksisterende importerte redigeringer som matcher den nyopprettede brukernavnet omattributeres via jobbkøen så de vises riktig på brukerens bidragsside. Hvis den er <code>false</code> skjer ikke dette.",
	"mwa-error-unknown": "Ukjent feil under innlogging på ekstern wiki.",
	"mwa-authfail": "Kunne ikke logge inn på den eksterne wikien for å importere kontoen din. Sjekk at du har riktig passord.",
	"mwa-authfail2": "Kunne ikke logge inn på den eksterne wikien for å importere kontoen din. Den eksterne wikien hadde følgende feil: $1",
	"mwa-finishcreate": "Kontoen din har blitt importert. Du kan sette et nytt passord nå, eller velge «$1» for å beholde det nåværende passordet.",
	"mwa-finishimport-nocreate": "Kontoen din har blitt importert. Velg et nytt passord for å forbedre sikkerheten.",
	"mwa-unconfiguredtitle": "Utvidelsen ikke konfigurert.",
	"mwa-unconfiguredtext": "MediaWikiAuth-utvidelsen er ikke konfigurert riktig. Sjekk at $wgMediaWikiAuthApiUrl er satt i LocalSettings.php til API-URL-en til den eksterne wikien.",
	"action-mwa-createlocalaccount": "opprette lokale kontoer med samme brukernavn som en ikke-importert ekstern konto",
	"right-mwa-createlocalaccount": "Opprette lokale kontoer med samme brukernavn som en uimportert ekstern konto"
}
