{
	"@metadata": {
		"authors": [
			"Jedimca0",
			"Mainframe98",
			"McDutchie"
		]
	},
	"mwa-desc": "Verifieert en importeert aanmeldgegevens van een externe MediaWiki-installatie",
	"mwa-config-allowpasswordchange": "Als dit op <code>true</code> (waar) is ingesteld, wordt de gebruiker na het importeren van het eigen account gevraagd om eventueel het wachtwoord te wijzigen (of op de knop Overslaan te klikken om hetzelfde wachtwoord te behouden).",
	"mwa-config-apiurl": "URL van de api.php van de externe wiki aan de hand waarvan er geauthenticeerd moet worden.",
	"mwa-config-importgroups": "Deze instelling bepaalt welke lokale gebruikersgroepen aan de gebruiker worden toegewezen. Als dit op <code>true</code> (waar) staat (de standaardinstelling), worden alle groepslidmaatschappen die de gebruiker op de externe wiki had, geïmporteerd in de lokale wiki, mits er lokaal groepen met dezelfde naam bestaan. Indien <code>false</code> (onwaar), worden er geen groepslidmaatschappen geïmporteerd. Als het een array is, geeft de instelling aan welke groepen moeten worden overgezet; alleen de vermelde groepen worden geïmporteerd. In beide gevallen kunnen impliciete groepen niet worden geïmporteerd en blijven alle groepsvervaldata intact.",
	"mwa-config-importoptions": "Deze instelling bepaalt welke gebruikersvoorkeuren uit de externe wiki worden geïmporteerd. Het is een array met interne optienamen van gebruikersvoorkeuren. Als er een jokerwaarde (<code>'*'</code>) in de array aanwezig is, wordt alles geïmporteerd. Als de array leeg is, worden er geen opties geïmporteerd. Als de array geen joker bevat, worden alleen de opgegeven opties geïmporteerd.",
	"mwa-config-skipoptions": "Deze instelling regelt welke gebruikersvoorkeuren niet uit de externe wiki worden geïmporteerd. Het is een array van interne optienamen van gebruikersvoorkeuren. De hier vermelde voorkeuren worden niet geïmporteerd, ook niet als ze in <code>$wgMediaWikiAuthImportOptions</code> vermeld staan. Dit is voornamelijk handig als u alles wilt importeren ''behalve'' bepaalde opties.",
	"mwa-config-disableaccountcreation": "Als dit op <code>true</code> (waar) staat, gaat MediaWikiAuth ervan uit dat alle relevante gebruikers al lokaal zijn aangemaakt, maar met ongeldige wachtwoordhashes. Dit is handig als u slechts een deel van de gebruikers op de externe wiki wilt importeren, bijvoorbeeld iedereen die op afstand bewerkingen heeft aangebracht. MediaWikiAuth detecteert dan het ongeldige wachtwoord en poogt aan de hand van de externe wiki de authenticatie te voltooien met het door de gebruiker opgegeven wachtwoord. Als dit lukt, wordt van de gebruiker gevraagd diens lokale wachtwoord wijzigen om in de toekomst normaal te kunnen inloggen.\n\nIn deze modus worden de volglijst en de groepen niet geïmporteerd en wordt geen bewerkingshertoewijzing uitgevoerd. Die instellingen worden genegeerd.",
	"mwa-config-importwatchlist": "Als dit op <code>true</code> (waar) staat, worden volglijsten via de takenwachtrij geïmporteerd. Indien <code>false</code> (onwaar), worden volglijsten niet geïmporteerd. Als u dit inschakelt, worden er extra verzoeken naar de externe API verzonden. Als de externe server uitzonderlijk traag is, kunnen deze extra verzoeken het gebruikersimportproces wegens het verlopen van de maximumtijd afbreken. In dat geval is het beter deze instelling uit te schakelen.",
	"mwa-config-reattributeedits": "Als dit op <code>true</code> (waar) is ingesteld, worden bestaande geïmporteerde bewerkingen die overeenkomen met de gebruikersnaam van het nieuw aangemaakte account opnieuw toegeschreven via de takenwachtrij, zodat ze correct worden weergegeven op de pagina Bijdragen van die gebruiker. Indien <code>false</code> vindt er geen hertoeschrijving plaats.",
	"mwa-error-unknown": "Onbekende fout tijdens het aanmelden bij de externe wiki.",
	"mwa-authfail": "Het is niet gelukt u aan te melden op de externe wiki om uw account te importeren. Zorg ervoor dat u het juiste wachtwoord gebruikt.",
	"mwa-authfail2": "Het is niet gelukt u aan te melden op de externe wiki om uw account te importeren. De externe wiki heeft de volgende foutmelding gegeven: $1",
	"mwa-finishcreate": "Het importeren van uw account is geslaagd. U kunt nu een nieuw wachtwoord instellen of \"$1\" kiezen om uw huidige wachtwoord te behouden.",
	"mwa-finishimport-nocreate": "Het importeren van uw account is afgerond. Stel nu voor uw veiligheid een nieuw wachtwoord in.",
	"mwa-unconfiguredtitle": "Uitbreiding is niet geconfigureerd.",
	"mwa-unconfiguredtext": "De uitbreiding MediaWikiAuth is niet juist ingesteld. Zorg ervoor dat $wgMediaWikiAuthApiUrl in uw LocalSettings.php is ingesteld op de API-URL van de externe wiki.",
	"action-mwa-createlocalaccount": "lokale accounts aan te maken met dezelfde gebruikersnaam als een niet geïmporteerd extern account",
	"right-mwa-createlocalaccount": "Lokale accounts aanmaken met dezelfde gebruikersnaam als een niet geïmporteerd extern account"
}
