{
	"@metadata": {
		"authors": [
			"Eduardo Addad de Oliveira"
		]
	},
	"mwa-desc": "Autenticar e importar logins de uma instância MediaWiki externa",
	"mwa-config-allowpasswordchange": "Se <code>true</code>, depois de importar sua conta, o usuário será solicitado a alterar opcionalmente sua senha (ou escolha um botão Ignorar para manter a mesma senha).",
	"mwa-config-apiurl": "URL do api.php do wiki remoto para autenticação.",
	"mwa-config-importgroups": "Essa configuração controla quais grupos de usuários locais são atribuídos ao usuário. Se <code>true</code> (padrão), todas as associações de grupo que o usuário tinha no wiki remoto são importadas para o wiki local, desde que existam grupos com o mesmo nome localmente. Se <code>false</code>, nenhuma associação ao grupo será importada. Se uma matriz, a configuração lista os grupos para copiar; somente os listados são importados. Em ambos os casos, os grupos implícitos não podem ser importados e os dados de expiração do grupo são mantidos intactos.",
	"mwa-config-disableaccountcreation": "Se </code>true</code>, o MediaWikiAuth assume que todos os usuários relevantes já foram criados localmente, mas com hashes de senha inválidos. Isso é útil se você deseja importar apenas um subconjunto de todos os usuários no wiki remoto, como qualquer pessoa que tenha editado remotamente. Se </code>true</code>, o MediaWikiAuth detectará a senha inválida e tentará se autenticar no wiki remoto com a senha fornecida pelo usuário. Se for bem-sucedido, o usuário precisará alterar sua senha local para que possa efetuar login normalmente no futuro.\n\nAo operar nesse modo, a lista de observação, as importações de grupo e a edição da reativação não acontecem. Essas configurações são ignoradas.",
	"mwa-config-importwatchlist": "Se <code>true</code>, as listas de páginas vigiadas serão importadas pela fila de trabalhos. Se <code>false</code>, as listas de páginas vigiadas não serão importadas. Habilitar isso causará solicitações adicionais à API remota. Se o servidor remoto estiver excepcionalmente lento, essas solicitações adicionais poderão atingir o tempo limite do processo de importação do usuário. Nesse caso, você desejará desativar essa configuração.",
	"mwa-config-reattributeedits": "Se <code>true</code>, as edições importadas existentes que correspondem ao nome de usuário da conta recém-criada serão reatribuídas pela fila de tarefas, para que sejam exibidas corretamente na página de Contribuições desse usuário. Se <code>false</code>, nenhuma reativação ocorre.",
	"mwa-error-unknown": "Erro desconhecido ao iniciar uma sessão na wiki remota.",
	"mwa-authfail": "Não é possível iniciar sessão no wiki remoto para importar a sua conta. Verifique se você está usando a senha correta.",
	"mwa-authfail2": "Não foi possível entrar na wiki remota para importar sua conta. A wiki remota teve o seguinte erro: $1",
	"mwa-finishcreate": "A sua conta foi importada. Pode definir uma senha nova ou escolher \"$1\" para manter a senha atual.",
	"mwa-finishimport-nocreate": "A sua conta foi importada. Defina uma senha nova para aumentar a segurança, por favor.",
	"mwa-unconfiguredtitle": "Extensão não configurada.",
	"mwa-unconfiguredtext": "A extensão MediaWikiAuth não está devidamente configurada. Certifique-se de que $wgMediaWikiAuthApiUrl está definido no seu LocalSettings.php como o URL da API da wiki remota.",
	"action-mwa-createlocalaccount": "criar contas locais com o mesmo nome de utilizador que uma conta externa não importada",
	"right-mwa-createlocalaccount": "Criar contas locais com o mesmo nome de utilizador que uma conta externa não importada"
}
