{
	"@metadata": {
		"authors": [
			"Hamilton Abreu"
		]
	},
	"mwa-desc": "Autentica contra, e importa as contas de, uma instância do MediaWiki externa",
	"mwa-config-allowpasswordchange": "Se <code>true</code>, depois de o utilizador importar a sua conta será proposto alterar opcionalmente a palavra-passe (ou escolher um botão Ignorar para manter a mesma palavra-passe).",
	"mwa-config-apiurl": "URL do api.php da wiki remota onde realizar a autenticação.",
	"mwa-config-importgroups": "Esta configuração controla que grupos locais de utilizadores são atribuídos ao utilizador. Se <code>true</code> (valor padrão), todas as atribuições a grupos que o utilizador tinha na wiki remota são importadas para a wiki local, desde que existam localmente grupos com o mesmo nome. Se <code>false</code>, não será importada nenhuma atribuição a grupos. Se tiver a forma de matriz, a configuração lista os grupos que deve copiar para a wiki local; só serão importados os grupos listados. Em qualquer dos casos, os grupos implícitos não podem ser importados e todos os dados de expiração de grupos são mantidos intactos.",
	"mwa-config-importoptions": "Esta configuração controla as preferências do utilizador que são importadas da wiki remota. É uma matriz de nomes internos das opções das preferências. Um carácter de substituição opcional (<code>'*'</code>) presente na matriz importará tudo. Se a matriz estiver vazia, não será importada nenhuma opção. Se a matriz não contiver um carácter de substituição, só serão importadas as opções especificadas.",
	"mwa-config-skipoptions": "Esta configuração controla as preferências do utilizador que não são importadas da wiki remota. É uma matriz de nomes internos das opções das preferências. As preferências listadas aqui não serão importadas, mesmo que estejam listadas em <code>$wgMediaWikiAuthImportOptions</code>. Isto é usado principalmente quando se pretende importar tudo ''exceto'' uma lista de opções.",
	"mwa-config-disableaccountcreation": "Se </code>true</code>, o MediaWikiAuth presume que todos os utilizadores relevantes já foram criados localmente, mas com resumos criptográficos da palavra-passe inválidos. Isto é útil se só desejar importar um subconjunto dos utilizadores da wiki remota, como, por exemplo, todos os que tenham feito edições remotas. Se </code>true</code>, o MediaWikiAuth detetará a palavra-passe inválida e tentará autenticar-se contra a wiki remota usando a palavra-passe fornecida pelo utilizador. Se tiver êxito, será exigido ao utilizador que altere a sua palavra-passe local para poder iniciar sessões normalmente no futuro.\n\nAo operar neste modo, as páginas vigiadas, as importações de grupos e a reatribuição de edições não são feitas. Essas definições são ignoradas.",
	"mwa-config-importwatchlist": "Se <code>true</code>, as listas de páginas vigiadas serão importadas através da fila de tarefas. Se <code>false</code>, as listas de páginas vigiadas não serão importadas. Ativar esta definição causará pedidos adicionais à API remota. Se o servidor remoto estiver excecionalmente lento, estes pedidos adicionais poderão causar o atingimento do tempo limite para o processo de importação de utilizadores. Neste caso, deverá desativar esta definição.",
	"mwa-config-reattributeedits": "Se <code>true</code>, as edições importadas existentes que correspondem ao nome de utilizador da conta recém-criada serão reatribuídas através da fila de tarefas, para serem mostradas corretamente na página de Contribuições desse utilizador. Se <code>false</code>, não é feita nenhuma reatribuição.",
	"mwa-error-unknown": "Erro desconhecido ao iniciar uma sessão na wiki remota.",
	"mwa-authfail": "Não foi possível iniciar uma sessão na wiki remota para importar a sua conta. Certifique-se de que está a usar a palavra-passe correta.",
	"mwa-authfail2": "Não foi possível entrar na wiki remota para importar a sua conta. A wiki remota apresentou o seguinte erro: $1",
	"mwa-finishcreate": "A sua conta foi importada. Pode definir uma palavra-passe nova ou escolher \"$1\" para manter a palavra-passe atual.",
	"mwa-finishimport-nocreate": "A sua conta foi importada. Defina uma palavra-passe nova para aumentar a segurança, por favor.",
	"mwa-unconfiguredtitle": "Extensão não configurada.",
	"mwa-unconfiguredtext": "A extensão MediaWikiAuth não está devidamente configurada. Certifique-se de que $wgMediaWikiAuthApiUrl está definido no seu LocalSettings.php como o URL da API da wiki remota.",
	"action-mwa-createlocalaccount": "criar contas locais com o mesmo nome de utilizador que uma conta externa não importada",
	"right-mwa-createlocalaccount": "Criar contas locais com o mesmo nome de utilizador que uma conta externa não importada"
}
