{
	"@metadata": {
		"authors": [
			"Eleassar"
		]
	},
	"mwa-desc": "Aventicira in uvozi prijave iz zunanje instance MediaWiki.",
	"mwa-config-allowpasswordchange": "Če je <code>true</code>, bo uporabnik po uvozu svojega računa pozvan, da po želji spremeni svoje geslo (ali izbere gumb »Preskoči«, da obdrži isto geslo).",
	"mwa-config-apiurl": "URL api.php oddaljenega vikija za avtentikacijo.",
	"mwa-config-importgroups": "Ta konfiguracija nadzoruje, katere lokalne uporabniške skupine se dodelijo uporabniku. Če je <code>true</code> (privzeto), se v lokalni viki uvozijo vsa članstva v skupinah, ki jih je imel uporabnik v oddaljenem vikiju, pod pogojem, da lokalno obstajajo skupine z istim imenom. Če je <code>false</code>, se ne uvozi nobeno članstvo v skupini. Če gre za matriko, konfiguracija navaja, katere skupine naj se kopirajo; uvozijo se samo naštete. V obeh primerih implicitnih skupin ni mogoče uvoziti, vsi podatki o preteku skupine pa ostanejo nespremenjeni.",
	"mwa-config-importoptions": "Ta konfiguracija nadzoruje, katere uporabniške nastavitve se uvozijo iz oddaljenega vikija. Je matrika imen internih možnosti uporabniških prilagoditev. Izbirna vrednost nadomestnega znaka (<code>'*'</code>), prisotna v matriki, bo uvozila vse. Če je matrika prazna, ne bodo uvožene nobene možnosti. Če matrika ne vsebuje nadomestnega znaka, bodo uvožene samo izbrane možnosti.",
	"mwa-config-skipoptions": "Ta konfiguracija nadzoruje, katere uporabniške nastavitve se ne uvozijo iz oddaljenega vikija. Je matrika internih imen možnosti uporabniških nastavitev. Tu navedene nastavitve se ne bodo uvozile, tudi če so navedene v <code>$wgMediaWikiAuthImportOptions</code>. To se uporablja predvsem, ko želite uvoziti vse ''razen'' nekega seznama možnosti.",
	"mwa-config-disableaccountcreation": "Če je <code>true</code>, MediaWikiAuth predpostavi, da so bili vsi ustrezni uporabniki že ustvarjeni lokalno, vendar z neveljavnimi zgoščenimi vrednostmi gesel. To je uporabno, če želite uvoziti samo del vseh uporabnikov iz oddaljenega vikiju, na primer vse, ki so urejali na daljavo. Če je <code>true</code>, bo MediaWikiAuth zaznal neveljavno geslo in poskusil avtenticirati oddaljeni viki s predloženim uporabniškim geslom. Če bo to uspelo, bo moral uporabnik spremeniti svoje lokalno geslo, da se bo lahko v prihodnje normalno prijavljal.\n\nPri delovanju v tem načinu se seznam nadzora, uvozi skupin in ponovna dodelitev urejanja ne zgodijo. Te nastavitve so prezrte.",
	"mwa-config-importwatchlist": "Če je <code>true</code>, bodo spiski nadzora uvoženi skozi čakalno vrsto opravil. Če je <code>false</code>, spiski nadzora ne bodo uvoženi. Če boste to vklopili, boste povzročili dodatne zahtevke za oddaljeni API. Če je oddaljeni strežnik izjemno počasen, lahko ti dodatni zahtevki prekinejo postopek uvoza uporabnikov. V tem primeru boste to nastavitev želeli izklopiti.",
	"mwa-config-reattributeedits": "Če je <code>true</code>, bodo obstoječa uvožena urejanja, ki se ujemajo z uporabniškim imenom novoustvarjenega računa, ponovno dodeljena skozi čakalno vrsto opravil, tako da bodo pravilno prikazana na strani s prispevki tega uporabnika. Če je <code>false</code>, do ponovne dodelitve ne pride.",
	"mwa-error-unknown": "Neznana napaka pri prijavi v oddaljeni viki.",
	"mwa-authfail": "Ni se mogoče prijaviti v oddaljeni viki za uvoz vašega računa. Zagotovite, da uporabljate pravilno geslo.",
	"mwa-authfail2": "Ni se mogoče prijaviti v oddaljeni viki za uvoz vašega računa. Oddaljeni viki je sporočil naslednjo napako: $1",
	"mwa-finishcreate": "Vaš račun je bil uspešno uvožen. Zdaj lahko nastavite novo geslo ali izberete »$1«, da obdržite svoje trenutno geslo.",
	"mwa-finishimport-nocreate": "Vaš račun je bil uspešno uvožen. Za večjo varnost nastavite novo geslo.",
	"mwa-unconfiguredtitle": "Razširitev ni konfigurirana.",
	"mwa-unconfiguredtext": "Razširitev MediaWikiAuth ni pravilno konfigurirana. Prepričajte se, da je $wgMediaWikiAuthApiUrl v vašem LocalSettings.php nastavljen na URL API-ja oddaljenega vikija.",
	"action-mwa-createlocalaccount": "ustvarjanje lokalnih računov z enakim uporabniškim imenom kot neuvoženi zunanji račun",
	"right-mwa-createlocalaccount": "Ustvarjanje lokalnih računov z enakim uporabniškim imenom kot neuvoženi zunanji račun"
}
