{
	"@metadata": {
		"authors": [
			"BaRaN6161 TURK"
		]
	},
	"mwa-desc": "Harici bir MediaWiki örneğinden girişleri doğrular ve girişleri doğrular",
	"mwa-config-allowpasswordchange": "Doğruysa, hesabını içe aktardıktan sonra kullanıcıdan isteğe bağlı olarak şifrelerini değiştirmesi istenir (veya aynı şifreyi korumak için bir Atla düğmesi seçmesi istenir).",
	"mwa-config-apiurl": "Kimlik doğrulaması yapılacak uzak wikinin api.php'sinin URL'si.",
	"mwa-config-importgroups": "Bu yapılandırma, kullanıcıya hangi yerel kullanıcı gruplarının atandığını denetler. True (varsayılan) ise, aynı ada sahip gruplar yerel olarak mevcut olması koşuluyla, kullanıcının uzak wikide sahip olduğu tüm grup üyelikleri yerel wiki'ye alınır. False olursa, hiçbir grup üyeliği içe aktarılmaz. Bir dizi ise, yapılandırma hangi grupların kopyalanacağını listeler; yalnızca listelenenler içe aktarılır. Her iki durumda da, örtük gruplar içe aktarılamaz ve herhangi bir grup son kullanma tarihi korunur.",
	"mwa-config-disableaccountcreation": "Değer doğruysa, MediaWikiAuth tüm ilgili kullanıcıların önceden yerel olarak oluşturulduğunu ancak geçersiz şifre karmalarıyla var olduğunu varsayar. Bu, yalnızca uzaktan wikideki tüm kullanıcıların, örneğin uzaktan düzenlenmiş olan herkesin bazı alt kümelerini içe aktarmak istiyorsanız yararlıdır. True olursa, MediaWikiAuth geçersiz parolayı algılar ve kullanıcının verdiği parolayla uzak wikiye karşı kimlik doğrulaması yapmaya çalışır. Başarılı olursa, kullanıcının gelecekte normal olarak oturum açabilmesi için yerel parolasını değiştirmesi istenir.\n\nBu modda çalışırken izleme listesi, grup içe aktarma ve düzenleme yeniden dağıtım gerçekleşmez. Bu ayarlar yok sayılır.",
	"mwa-config-importwatchlist": "Değer doğruysa, izleme listeleri iş kuyruğu üzerinden içe aktarılır. Yanlışsa, izleme listeleri içe aktarılmaz. Bunu etkinleştirmek, uzak API için ek isteklere neden olur. Uzak sunucu son derece yavaşsa, bu ek istekler kullanıcı içe aktarma işlemini zaman aşımına uğratabilir. Bu durumda, bu ayarı devre dışı bırakmak istersiniz.",
	"mwa-config-reattributeedits": "Doğruysa, yeni oluşturulan hesabın kullanıcı adıyla eşleşen mevcut içe aktarılan düzenlemeler iş kuyruğu üzerinden yeniden dağıtılacak ve böylece kullanıcının Katkılar sayfasında düzgün bir şekilde gösterilecektir. Yanlışsa, yeniden dağıtım gerçekleşmez.",
	"mwa-error-unknown": "Uzak wikiye giriş yaparken bilinmeyen hata.",
	"mwa-authfail": "Hesabınızı almak için uzak wikiye giriş yapamıyor. Doğru şifreyi kullandığınızdan emin olun.",
	"mwa-finishcreate": "Hesabınız başarıyla içe aktarıldı. Şimdi yeni bir şifre belirleyebilir veya mevcut şifrenizi korumak için \"$1\" seçeneğini seçebilirsiniz.",
	"mwa-finishimport-nocreate": "Hesabınız başarıyla içe aktarıldı. Lütfen daha iyi güvenlik için yeni bir şifre belirleyin.",
	"mwa-unconfiguredtitle": "Uzantı yapılandırılmadı.",
	"mwa-unconfiguredtext": "MediaWikiAuth uzantısı doğru şekilde yapılandırılmamış. $WgMediaWikiAuthApiUrl öğesinin LocalSettings.php dosyasında uzak wikinin API URL'sine ayarlandığından emin olun.",
	"action-mwa-createlocalaccount": "desteklenmeyen bir dış hesapla aynı kullanıcı adına sahip yerel hesaplar oluşturun",
	"right-mwa-createlocalaccount": "Desteklenmeyen bir dış hesapla aynı kullanıcı adına sahip yerel hesaplar oluşturun"
}
