{
	"@metadata": {
		"authors": [
			"Movses",
			"Piramidion",
			"Vlad5250",
			"Ата"
		]
	},
	"mwa-desc": "Автентифікує, порівнюючи із зовнішнім примірником MediaWiki, та імпортує логіни звідти ж",
	"mwa-config-allowpasswordchange": "Якщо <code>true</code>, то після імпортування облікового запису користувач отримає пропозицію змінити пароль (або скористатися кнопкою «Пропустити», щоб зберегти той самий пароль).",
	"mwa-config-apiurl": "URL-адреса api.php віддаленої вікі, відносно якої слід проводити автентифікацію.",
	"mwa-config-importgroups": "Ця конфігурація контролює, які саме локальні групи користувачів мають бути призначеними користувачеві. Якщо <code>true</code> (стандартно), усі членства в групах, які були в користувача у віддаленій вікі, будуть імпортовані до локальної вікі за умови, що відповідні групи з такими ж назвами існують і в ній. Якщо <code>false</code>, то не буде імпортовано жодного членства в групі. Якщо є масив, то конфігурація перелічує, які групи буде скопійовано; буде імпортовано лише ті групи, які перелічено в конфігурації. У будь-якому разі специфічні для окремої вікі групи неможливо імпортувати, а будь-які обмеження часу перебування в групі зберігаються після імпортування.",
	"mwa-config-disableaccountcreation": "Якщо <code>true</code>, то MediaWikiAuth припускає, що всіх релевантних користувачів уже було створено локально, але з недійсними хешами паролів. Це корисно, якщо ви лише хочете імпортувати якийсь невеликий набір із користувачів віддаленої вікі, наприклад, усіх тих, хто робив редагування віддалено. Якщо <code>true</code>, MediaWikiAuth виявить недійсний пароль і спробує зробити вхід через віддалену вікі, використовуючи заданий пароль користувача. Якщо вхід буде успішним, користувачеві необхідно буде змінити свій локальний пароль, щоб у майбутньому можна було входити в систему звичним чином.\n\nПри використанні цього режиму, імпортування списку спостереження, груп користувачів та реатрибуція не відбуваються. Ці налаштування ігноруються.",
	"mwa-config-importwatchlist": "Якщо <code>true</code>, списки спостереження буде імпортовано через чергу завдань. Якщо <code>false</code>, списки спостереження імпортуватися не будуть. Увімкнення цієї опції спричинить додаткові запити до віддаленої API. Якщо віддалений сервер виявиться винятково повільним, ці додаткові запити можуть спричинити таймаут процесу імпортування користувача. У такому випадку варто вимкнути це налаштування.",
	"mwa-config-reattributeedits": "Якщо <code>true</code>, наявні імпортовані редагування, які збігаються із новоствореним іменем користувача нового облікового запису, пройдуть реатрибуцію через чергу завдань, аби їх можна було належним чином переглядати на сторінці внеску користувача. Якщо <code>false</code>, реатрибуція не відбудеться.",
	"mwa-error-unknown": "Невідома помилка при спробі входу в систему на віддаленій вікі.",
	"mwa-authfail": "Не вдалося увійти в систему на віддаленій вікі, щоб імпортувати Ваш обліковий запис. Переконайтесь, що Ви використовуєте правильний пароль.",
	"mwa-authfail2": "Не вдалося увійти у віддалену вікі, щоб імпортувати ваш обліковий запис. Віддалена вікі видала таку помилку: $1",
	"mwa-finishcreate": "Ваш обліковий запис успішно імпортовано. Тепер можете встановити новий пароль, або ж виберіть «$1» якщо хочете зберегти поточний.",
	"mwa-finishimport-nocreate": "Ваш обліковий запис було успішно імпортовано. Будь ласка, встановіть йому новий пароль для кращої безпеки.",
	"mwa-unconfiguredtitle": "Розширення не налаштовано.",
	"mwa-unconfiguredtext": "Розширення MediaWikiAuth не налаштовано належним чином. Переконайтесь, що значення $wgMediaWikiAuthApiUrl у Вашому LocalSettings.php є URL-адресою API віддаленої вікі.",
	"action-mwa-createlocalaccount": "створення локальних облікових записів з таким самим іменем користувача, як і в неімпортованого зовнішнього облікового запису",
	"right-mwa-createlocalaccount": "Створення локальних облікових записів з таким самим іменем користувача, як і в неімпортованого зовнішнього облікового запису"
}
